In [2]:
import pandas as pd

In [4]:
# Creating a Series
s = pd.Series([10, 20, 30, 40])
print(s)

0    10
1    20
2    30
3    40
dtype: int64

In [14]:
s = pd.Series([10, 20, 30], index=[1, 2, 3])

p = pd.Series([10,20,30], index=[1, 2, 3] )
print(p)

1    10
2    20
3    30
dtype: int64

In [63]:
# Creating a DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie'],
    'Age': [25, 30, 35],
    'City': ['New York', 'Los Angeles', 'Chicago']
}

data1 = {
    'Name': ['Rahul', 'Heena', 'Manish', 'Alice', 'Bob', 'Charlie'], 
    'Age': [24, 40, 46, 25, 30, 35], 
    'City': ['New Delhi','Mumbai', 'Delhi', 'New York', 'Los Angeles', 'Chicago']
}

df1 = pd.DataFrame(data1)
print(df1)

      Name  Age         City
0    Rahul   24    New Delhi
1    Heena   40       Mumbai
2   Manish   46        Delhi
3    Alice   25     New York
4      Bob   30  Los Angeles
5  Charlie   35      Chicago

In [15]:
df = pd.DataFrame(data1)
print(df)

      Name  Age       City
0    Alice   24  New Delhi
1      Bob   40     Mumbai
2  Charlie   46      Delhi

In [19]:
df.head()

      Name  Age       City
0    Alice   24  New Delhi
1      Bob   40     Mumbai
2  Charlie   46      Delhi

In [20]:
df.tail()

      Name  Age       City
0    Alice   24  New Delhi
1      Bob   40     Mumbai
2  Charlie   46      Delhi

In [22]:
df.describe()

             Age
count   3.000000
mean   36.666667
std    11.372481
min    24.000000
25%    32.000000
50%    40.000000
75%    43.000000
max    46.000000

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   City    3 non-null      object
dtypes: int64(1), object(2)
memory usage: 204.0+ bytes

In [26]:
print(df['Age'])
print(df['Name'])
print(df['City'])

0    24
1    40
2    46
Name: Age, dtype: int64
0      Alice
1        Bob
2    Charlie
Name: Name, dtype: object
0    New Delhi
1       Mumbai
2        Delhi
Name: City, dtype: object

In [27]:
print(df[['Name', 'Age']])

      Name  Age
0    Alice   24
1      Bob   40
2  Charlie   46

In [30]:
print(df.iloc[0])
print(df.iloc[0:2])

Name        Alice
Age            24
City    New Delhi
Name: 0, dtype: object
    Name  Age       City
0  Alice   24  New Delhi
1    Bob   40     Mumbai

In [32]:
#Adding new element
df['Salary']= [2300, 3400, 5600]

In [33]:
print(df)

      Name  Age       City  Salary
0    Alice   24  New Delhi    2300
1      Bob   40     Mumbai    3400
2  Charlie   46      Delhi    5600

In [44]:
df.drop('Salary', axis=1)
df.drop(1, axis=0)
print(df)

      Name  Age       City  Salary
0    Alice   24  New Delhi    2300
1      Bob   40     Mumbai    3400
2  Charlie   46      Delhi    5600

In [ ]:
#Sorting Data
df.sort_values('Age', ascending=True)

      Name  Age       City  Salary
0    Alice   24  New Delhi    2300
1      Bob   40     Mumbai    3400
2  Charlie   46      Delhi    5600

In [51]:
grouped_By = df.groupby('City')
print(df)

      Name  Age       City  Salary
0    Alice   24  New Delhi    2300
1      Bob   40     Mumbai    3400
2  Charlie   46      Delhi    5600

In [61]:
meargedData = pd.merge(df, df1 , on='City')
print(meargedData)

    Name_x  Age_x       City  Salary  Name_y  Age_y
0    Alice     24  New Delhi    2300   Rahul     24
1      Bob     40     Mumbai    3400   Heena     40
2  Charlie     46      Delhi    5600  Manish     46